{
  "characters": [
    {
      "name": "Abrams",
      "tips": [],
      "counters": [
        "Abrams hace mucho menos daño con su escopeta si peleas desde lejos. Su estilo se basa en presionarte cuerpo a cuerpo, así que mantenerlo fuera de rango reduce gran parte de su amenaza.",
        "Saltar o hacer doble salto cuando carga hacia ti puede hacer que falle y quedes sobre él. Es una forma sencilla de esquivar y ganar tiempo para reposicionarte.",
        "Antes de mejorar su carga al máximo, Abrams solo puede garantizar un golpe ligero tras impactar. Con dos puntos en la habilidad obtiene más duración del aturdimiento y puede asegurar un golpe pesado. Si intenta usarlo antes de tiempo, puedes aprovechar para hacerle parry.",
        "Con más del 40 % de reducción de debuffs, gracias a ítems como Weighted Shots, Spell Break o Debuff Reducer, puedes parryar tanto su heavy melee de carga como el de su ultimate, dejándolo totalmente vulnerable.",
        "Reactive Barrier impide que te elimine de un solo golpe, forzándolo a gastar más recursos y dándote tiempo para reaccionar.",
        "Close Quarters o Point Blank aumentan la resistencia al daño melee, útiles si Abrams busca constantemente pelearte de cerca. Son opciones sólidas frente a su estilo agresivo.",
        "Cualquier efecto anti-heal limita su capacidad de curación, reduciendo su sostenibilidad y obligándolo a retroceder.",
        "Slowing Hex puede frenar su carga y hacer que la falle por completo. Úsalo cuando se empiece a tirar.",
        "Su Shoulder Charge tiene un enfriamiento aproximado de 37 segundos, lo que equivale a una wave. Si la falla, se vuelve mucho menos peligroso hasta que vuelva a tenerla disponible."
      ]
    },
    { 
        "name": "Bebop", 
        "tips": [], 
        "counters": ["Siempre asume que Bebop tiene su gancho disponible; evita quedarte en campo abierto y mantente cerca de cobertura para esquivarlo.",
            "Si Bebop te engancha y trata de arrastrarte hacia la torre, usa tu puñetazo para cancelar el impulso y escapar del desplazamiento.",
            "El Reactive Barrier es excelente contra él, ya que normalmente necesita engancharte para matarte, y el escudo se activa justo en ese momento.",
            "Usar Debuff Remover o Counter Spell sirve para limpiar o bloquear las bombas que coloca sobre ti.",
            "Si Bebop está canalizando su definitiva, puedes cancelarla con un Knockdown; esto interrumpe su vuelo y lo deja aturdido.",
            "El gancho de Bebop tiene un enfriamiento de 23 segundos; cuando lo gasta, se vuelve mucho menos peligroso hasta que vuelva a estar disponible.",
            "Aprovecha cuando falle su gancho o use ambas estaminas para castigar; al inicio solo tiene dos puntos de estamina y queda vulnerable.",
            "Evita dejar que te coloque bombas fácilmente; si fuerza una entrada con rodar, sabrás que quedará sin movilidad por unos segundos (18s o 10s según el nivel)."] },
    { "name": "Billy", "tips": [], "counters": [] },
    { "name": "Calico", "tips": [], "counters": [] },
    { "name": "Drifter", "tips": [], "counters": [] },
    { "name": "Dynamo", "tips": [], "counters": [] },
    { "name": "Grey Talon", "tips": [], "counters": [] },
    { "name": "Haze", "tips": [], "counters": [] },
    { "name": "Holliday", "tips": [], "counters": [] },
    { "name": "Infernus", "tips": [], "counters": [] },
    { "name": "Ivy", "tips": [], "counters": [] },
    { "name": "Kelvin", "tips": [], "counters": [] },
    { "name": "Lady Geist", "tips": [], "counters": [] },
    { "name": "Lash", "tips": [], "counters": [] },
    { "name": "McGinnis", "tips": [], "counters": [] },
    { "name": "Mina", "tips": [], "counters": [] },
    { "name": "Mirage", "tips": [], "counters": [] },
    { "name": "Mo & Krill", "tips": [], "counters": [] },
    { "name": "Paige", "tips": [], "counters": [] },
    { "name": "Paradox", "tips": [], "counters": [] },
    { "name": "Pocket", "tips": [], "counters": [] },
    { "name": "Seven", "tips": [], "counters": [] },
    { "name": "Shiv", "tips": [], "counters": [] },
    { "name": "Doorman", "tips": [], "counters": [] },
    { "name": "Sinclair", "tips": [], "counters": [] },
    { "name": "Victor", "tips": [], "counters": [] },
    { "name": "Vindicta", "tips": [], "counters": [] },
    { "name": "Viscous", "tips": [], "counters": [] },
    { "name": "Vyper", "tips": [], "counters": [] },
    { "name": "Warden", "tips": [], "counters": [] },
    { "name": "Wraith", "tips": [], "counters": [] },
    { "name": "Yamato", "tips": [], "counters": [] }
  ]
}