{
  "characters": [
    {
      "name": "Abrams",
      "tips": [],
      "counters": [
        "Abrams hace mucho menos daño con su escopeta si peleas desde lejos. Su estilo se basa en presionarte cuerpo a cuerpo, así que mantenerlo fuera de rango reduce gran parte de su amenaza.",
        "Saltar o hacer doble salto cuando carga hacia ti puede hacer que falle y quedes sobre él. Es una forma sencilla de esquivar y ganar tiempo para reposicionarte.",
        "Antes de mejorar su carga al máximo, Abrams solo puede garantizar un golpe ligero tras impactar. Con dos puntos en la habilidad obtiene más duración del aturdimiento y puede asegurar un golpe pesado. Si intenta usarlo antes de tiempo, puedes aprovechar para hacerle parry.",
        "Con más del 40 % de reducción de debuffs, gracias a ítems como Weighted Shots, Spell Break o Debuff Reducer, puedes parryar tanto su heavy melee de carga como el de su ultimate, dejándolo totalmente vulnerable.",
        "Reactive Barrier impide que te elimine de un solo golpe, forzándolo a gastar más recursos y dándote tiempo para reaccionar.",
        "Close Quarters o Point Blank aumentan la resistencia al daño melee, útiles si Abrams busca constantemente pelearte de cerca. Son opciones sólidas frente a su estilo agresivo.",
        "Cualquier efecto anti-heal limita su capacidad de curación, reduciendo su sostenibilidad y obligándolo a retroceder.",
        "Slowing Hex puede frenar su carga y hacer que la falle por completo. Úsalo cuando se empiece a tirar.",
        "Su Shoulder Charge tiene un enfriamiento aproximado de 37 segundos, lo que equivale a una wave. Si la falla, se vuelve mucho menos peligroso hasta que vuelva a tenerla disponible."
      ]
    },
    { 
        "name": "Bebop", 
        "tips": [], 
        "counters": ["Siempre asume que Bebop tiene su gancho disponible; evita quedarte en campo abierto y mantente cerca de cobertura para esquivarlo.",
            "Si Bebop te engancha y trata de arrastrarte hacia la torre, usa tu puñetazo para cancelar el impulso y escapar del desplazamiento.",
            "El Reactive Barrier es excelente contra él, ya que normalmente necesita engancharte para matarte, y el escudo se activa justo en ese momento.",
            "Usar Debuff Remover o Counter Spell sirve para limpiar o bloquear las bombas que coloca sobre ti.",
            "Si Bebop está canalizando su definitiva, puedes cancelarla con un Knockdown; esto interrumpe su vuelo y lo deja aturdido.",
            "El gancho de Bebop tiene un enfriamiento de 23 segundos; cuando lo gasta, se vuelve mucho menos peligroso hasta que vuelva a estar disponible.",
            "Aprovecha cuando falle su gancho o use ambas estaminas para castigar; al inicio solo tiene dos puntos de estamina y queda vulnerable.",
            "Evita dejar que te coloque bombas fácilmente; si fuerza una entrada con rodar, sabrás que quedará sin movilidad por unos segundos (18s o 10s según el nivel)."] },
    { "name": "Billy", 
    "tips": [], 
    "counters": [
    "No dejes que se quede en tu cara; su SMG hace muchísimo daño a corta distancia, incluso sin build de arma.",
    "Anticipa sus light melees y su Rising Ram (2da) para poder parry o esquivar.",
    "Si ultea, intenta romper línea de visión; esto evita que te jale o te desplace de forma peligrosa.",
    "Mantente atento a su posición; no lo dejes aprovechar espacios abiertos donde pueda acercarse con facilidad.",
    "Si te engancha con su 2da, Reactive Barrier se activa al momento del desplazamiento, mitigando gran parte del daño.",
    "Counter Spell es útil para evitar que su ulti o su 2da te desplacen o golpeen de forma sorpresiva.",
    "Close Quarters da resistencia melee; esto es clave porque Billy usa mucho light melee para castigar.",
    "Anti-heal reduce la efectividad de su Blasted(3era), especialmente si está constantemente meleeando a tus aliados.",
    "Su habilidad Rising Ram (2da) tiene un CD de 30s (aprox. un wave) y se reduce 50% si golpea a alguien; monitorear esto permite castigar cuando está sin 2da.",
    "Si ves que falla su 2da, tiene 30s para intentar otro ataque fuerte, lo que es un momento ideal para presionarlo o farmear con seguridad.",
    "Evita agruparte con tu equipo cerca de él; puede usar su 2da y su ulti para deshabilitar a varios a la vez.",
    "Mantén distancia de los bordes o espacios donde pueda usar la gravedad de su ulti para desplazarte hacia zonas peligrosas.",
    "Presta atención a su stamina: si ha usado varias habilidades de forma consecutiva, puede estar sin recursos para atacar agresivamente.",
    "Considera slowing debuffs o CC si tu personaje puede aplicarlos; limita su capacidad de acercamiento y castigo.",
    "Al farmear o tradear, cuenta con la ventana de cooldown de su Two para ser agresivo cuando no puede ejecutar su combo completo."
    ] },
    { "name": "Calico", "tips": [], "counters": [
    "Empuja la wave constantemente para negarle tiempo de farmear con sus cajas; esto evita que acumule almas y escale en el early game.",
    "Haz que la wave choque contra su torre; así la obligas a defender y le niegas el tiempo para rotar o colocar cajas libremente.",
    "Si mantienes la presión, evitas que entre en modo gato y farmee segura; forzarla a jugar defensiva reduce mucho su poder temprano.",
    "Close Quarters es muy útil contra ella, ya que otorga resistencia melee y su habilidad Two inflige daño cuerpo a cuerpo.",
    "Counter Spell puede negar su burst combo completo si lo activas justo cuando inicia su cadena de daño.",
    "Sus bombas son fáciles de bloquear con Counter Spell si predices cuándo las lanzará.",
    "Puedes predecir y contrarrestar su Leaping Slash con Counter Spell, ya que tiene una animación visible antes del golpe.",
    "Si activa su combo cuerpo a cuerpo encima de ti, Counter Spell también puede protegerte del burst completo.",
    "Slowing Hex puede frenar su carga y hacer que la falle por completo. Úsalo cuando se empiece a tirar.",
    "También puedes usar Slowing Hex para mantenerla a rango y evitar que se acerque a tus aliados o huya tras un combo.",
    "Durante el early game, su habilidad clave es Leaping Slash, con un cooldown de unos 11 segundos; cuando la gasta, queda muy vulnerable.",
    "Si ves que falla o usa Leaping Slash de forma defensiva, aprovecha esa ventana para presionarla o farmear con seguridad.",
    "En teamfights, monitorea si tiene disponible su transformación en gato; si no la tiene, su movilidad y supervivencia bajan mucho.",
    "Su habilidad Ava (para cajas) importa más para farmeo que para combate directo; enfócate en castigar cuando gaste Leaping Slash en lugar de Ava."
    ] },
    { "name": "Drifter", "tips": [], "counters": [    
    "Mantén buena distancia de él en lane; su daño aumenta mucho si logra conectar las garras tier 2, que tienen más rango y hacen daño adicional.",
    "Evita permanecer dentro de su rango cuerpo a cuerpo; las garras tier 1 hacen daño moderado, pero las tier 2 pueden quitarte gran parte de la vida en pocos golpes.",
    "Presta atención constante a su posición en línea; si lo pierdes de vista, puede castigar fácilmente con su movilidad.",
    "Durante su ulti, la mejor manera de contrarrestarlo es con comunicación: avisa a tu equipo si fuiste afectado para coordinar la respuesta.",
    "Usar comunicación activa (micrófono o ping) durante su ulti reduce drásticamente su efectividad en peleas grupales.",
    "Debuff Remover es muy bueno contra él: elimina el efecto de sangrado de su Segunda y evita que recastee el teleport detrás tuyo.",
    "Divine Barrier limpia su ulti; si eres support, úsala sobre aliados que estén bajo su efecto para anular su control.",
    "Disarming Hex es útil cuando se te lanza encima o te teleporta para burstearte; al aplicarlo, evita que dispare y te da tiempo para huir o recibir ayuda.",
    "Su habilidad clave en lane es Stalker’s Mark, con 20s de cooldown; controla este tiempo para saber cuándo no tiene movilidad.",
    "El bleed de Stalker’s Mark hace daño en base a la vida actual, así que duele más cuando estás con mucha vida.",
    "Si no tiene disponible su 2da, pierde la capacidad de teletransportarse o escapar; es el mejor momento para castigarlo.",
    "Si lanza su 2da en la wave para escapar, sabrás que queda vulnerable hasta que vuelva el cooldown."] },
    { "name": "Dynamo", "tips": [], "counters": [
    "Mantén distancia entre tú y tus aliados para que Dynamo no pueda golpear a ambos con su habilidad.",
    "Evita agruparte en pasillos o choke points para no facilitarle un ultimate masivo.",
    "Si Dynamo tiene su ultimate disponible, evita iniciar peleas agrupadas.",
    "Monitorea si compra Refresher y mantén control de su enfriamiento.",
    "Cuando use su patada en línea, puedes esquivarla haciendo doble salto; es fácil de anticipar.",
    "Si Dynamo se acerca rodando hacia ti, probablemente va a usar su patada: prepárate para el doble salto.",
    "El ítem Slowing Hex es excelente contra Dynamo; anula su 2da.",
    "Si usas personajes como Bebop, aplica tus bombas y luego Slowing Hex para que no pueda esquivarlas.",
    "Si Dynamo usa una build centrada en patadas (kick build), Spellbreaker es un gran counter: niega su primer kick y gran parte de su daño y poke.",
    "Los warp stone es efectivo contra su build de patadas en cadena, ya que te permiten reposicionarte lejos de tu equipo cuando inicia con su ultimate.",
    "Dynamo puede encadenar CCs una vez que obtiene Rapid Recharge, por lo que tener movilidad o formas de escapar es esencial.",
    "Si juegas soporte, usa Rescue Beam para sacar a tus aliados de su ultimate.",
    "Knockdown funciona bien contra Dynamo si se arma Duration Extender, ya que corta su ultimate a mitad de canalización.",
    "Su habilidad clave es su Habilidad 2: si está en enfriamiento, Dynamo queda muy vulnerable.",
    "Personajes agresivos como Bebop o Holiday pueden castigarlo cuando su habilidad 2 no está disponible.",
    "La habilidad 2 de Dynamo tiene un enfriamiento de 16 segundos; cuando está desactivada, solo puede defenderse con su patada o rodando."
    ] },
    { "name": "Grey Talon", "tips": [], "counters": [
          "Espera a que sus trampas desaparezcan si no están en un punto de choke; duran 20 segundos, así que no te precipites.",
    "Si sus trampas están en un punto de choke, sí es útil baitarlas, ya que de lo contrario solo te maldecirán.",
    "Evita acercarte a sus trampas si él puede verte con flechas o detectar la trampa; si no puede verte, puedes intentar baitarlas.",
    "Spellbreaker es muy efectivo contra Grey Talon; niega el daño de sus flechas y del ave, así como el on-hit de Spirit Burn y Tank Buster, reduciendo este daño en 75%.",
    "Knockdown funciona muy bien para sacarlo del aire, especialmente antes de que compre Counter Spell o si no lo compra.",
    "Knockdown también puede usarse para interrumpir su ultimate y evitar que el ave llegue a tu aliado.",
    "Counter Spell puede ser usado para negar sus flechas y su ave si se practica lo suficiente, útil contra jugadores predecibles.",
    "Prioriza evitar su poke constante; su daño y control a distancia pueden acumularse si lo subestimas.",
    "A nivel medio o bajo, su ave suele ser predecible, lo que permite bloquearla con Counter Spell o Eyeframes.",
    "Al enfrentarlo, considera mantenerte cerca de aliados para mitigar su daño y control."
    ] },
    { "name": "Haze", "tips": [], "counters": [
    "Juega alrededor de esquinas. Si Haze te salta y usa su ultimate, moverte alrededor de una esquina reduce drásticamente su valor.",
    "Siempre posicionate cerca de cobertura o esquinas para evitar que te elimine fácilmente desde el sigilo o el rango.",
    "Sé consciente de su ubicación. Si la ves en una línea, puedes empujar la opuesta con mayor seguridad.",
    "En línea, deja que las acumulaciones de Fixation expiren. Muchos Haze mantienen la pasiva activa lanzando balas ocasionales para mantenerla en ti.",
    "Si notas que acumula Fixation, evita tradear hasta que se reinicie; de lo contrario, te eliminará con daño explosivo inesperado.",
    "Plated Armor es el mejor ítem contra Haze: reduce su daño en 30% y corta las acumulaciones de Fixation a la mitad.",
    "Warp stone es excelente contra Haze: permite escapar de su ultimate y otorga 40% de resistencia a balas.",
    "Return Fire es muy efectivo: puedes activarlo durante su ultimate para reflejar daño y sobrevivir más tiempo.",
    "Metal Skin funciona similar a Return Fire pero es una opción más económica.",
    "Disarming Hex también son buenos contra personajes con armas de fuego en general, incluido Haze.",
    "Si Haze usa su ultimate contra varios enemigos, su daño se divide entre ellos; es más fuerte en objetivos individuales.",
    "Si cuatro jugadores están dentro de su ultimate, el daño efectivo se reduce drásticamente. Puedes aprovechar para eliminarla.",
    "Si duerme a un aliado, rueda encima de él y prepárate para hacer parry al ataque cuerpo a cuerpo que sigue.",
    "Cuando no tiene Sleep Dagger disponible, Haze es mucho más vulnerable y puede ser fácilmente castigada."
    ] },
    { "name": "Holliday", "tips": [], "counters": [
    "Los barriles de Holiday solo explotan instantáneamente si los golpea con un ataque cuerpo a cuerpo; puedes aprovechar esto para parryearla cuando intente detonarlos en tu cara.",
    "Si te lanza un barril seguido de un lazo, prepara un parry o esquiva. Este combo es muy común y predecible.",
    "Entrar en su rango cuerpo a cuerpo la incomoda mucho, ya que se vuelve más fácil leer sus ataques ligeros y predecir sus detonaciones.",
    "Si no estás haciendo parry, su ataque cuerpo a cuerpo ligero aún conectará y causará daño; no te confíes.",
    "La mayoría de las Holiday de alto nivel usan barril + lazo para asegurar el control; su movimiento es muy predecible durante este combo.",
    "Usa Warpstone para salir del levantamiento (knock-up) o esquivar su lazo. El tiempo de reacción lo hace bastante consistente.",
    "Warpstone también sirve para escapar de sus barriles o evitar quedar atrapado en su combo principal.",
    "Counter Spell es muy útil contra su ultimate: puedes lanzarlo justo cuando escuches el sonido de carga o veas la animación de giro.",
    "También puedes usar Counter Spell para bloquear barriles.",
    "La reducción o limpieza de debuffs (debuff removal) es excelente contra Holiday, ya que acorta la duración del lazo y reduce su capacidad de aislarte del equipo.",
    "Tener reducción de debuffs también disminuye el efecto de ralentización de su Crack Shot, ayudando a escapar de ella.",
    "Slowing Hex es extremadamente efectivo: cuando está bajo su efecto, Holiday no puede usar su habilidad secundaria (Two), lo que deja una ventana de 3.5 segundos para eliminarla.",
    "En equipo, si ves que Holiday salta hacia todos con su combo, aplica Slowing Hex para frenar completamente su ofensiva.",
    "Su habilidad más opresiva en línea es Crack Shot, con un enfriamiento de 20 segundos. Vigila su disponibilidad antes de tradear.",
    "Puedes ver si Crack Shot está lista observando su arma: si brilla, la habilidad está disponible; si no, está en enfriamiento.",
    "Evita enfrentarte a ella en intercambios de disparos cuando su arma brilla (Crack Shot activa).",
    "Si Crack Shot está en enfriamiento, sus intercambios son mucho más débiles, y es el momento ideal para castigarla."
  
    ] },
    { "name": "Infernus", "tips": [], "counters": [
    "Evita dejar que Infernus acumule su quemadura (burn) sobre ti; si notas que sube mucho, retrocede o busca cobertura para dejar que se reinicie.",
    "Jugar cerca de esquinas o coberturas te permite romper su línea de fuego y evitar que mantenga su efecto de quemadura activo.",
    "Nunca te enfrentes a intercambios prolongados con Infernus; gana poder a medida que mantiene su Ignite sobre ti.",
    "Observa el indicador visual de Ignite (una pequeña llama o ícono de quemadura). Cuando se llena, explotará y causará daño adicional.",
    "Nunca asomes mientras estás bajo el efecto de quemadura; si lo haces, le permites mantener la duración de su Ignite y aumentar su daño.",
    "Recuerda que su Flame Dash no puede subir superficies elevadas, a menos que compre Warpstone (algo que casi nunca sucede).",
    "Aprovecha el terreno elevado (puentes o plataformas) para negarle daño con su dash y romper su línea de visión.",
    "Evita tanquear su dash mientras estás en llamas, ya que el fuego no se disipa y él seguirá sosteniendo su Ignite.",
    "Si ves que usa su dash para mantenerse agresivo, espera a que entre en enfriamiento y castígalo; se vuelve mucho más vulnerable sin movilidad.",
    "El ítem Debuff Reducer (o limpieza de estados) es excelente contra él: limpia el burn, reduce la duración del stun de su ultimate y el slow de su napalm.",
    "El napalm de Infernus también aplica un debuff; puedes limpiarlo con debuff remover, reduciendo su duración y daño sostenido.",
    "Plated Armor es muy útil, ya que disminuye su daño de bala y también reduce los efectos de sus golpes al impacto (on-hit).",
    "Con Plated Armor, le tomará el doble de tiempo en acumular su afterburn, reduciendo significativamente su daño sostenido.",
    "Slowing Hex es extremadamente efectivo contra él: cuando está bajo su efecto, no puede usar su dash y queda completamente expuesto.",
    "Si usa un build de daño rápido o se sobreextiende para presionar, castígalo con Slowing Hex para inmovilizarlo y eliminarlo.",
    "Su dash tiene un enfriamiento de aproximadamente 37 segundos, lo que equivale a una oleada completa. Aprovecha cuando esté en cooldown para forzarlo.",
    "Cuando tiene el dash disponible, puede ganar la mayoría de los intercambios al combinarlo con Ignite; no pelees sin recursos.",
    "Sin su dash, Infernus es inmóvil y predecible; es el mejor momento para emboscarlo o lanzarte sobre él."
    ] },
    { "name": "Ivy", "tips": [], "counters": [
    "Usa la verticalidad del mapa para evitar sus Kudzu Bombs: si los lanza arriba, juega por debajo; si los lanza abajo, súbete a estructuras.",
    "Utiliza control de masas (CC) para interrumpir su ultimate mientras canaliza. Por ejemplo, con Mirage puedes usar el tornado justo después de que empiece a canalizar para cancelarla.",
    "Habilidades como la carga de Abrams o cualquier CC estándar pueden detener su ultimate si las usas durante la canalización.",
    "El ítem Knockdown es excelente: puedes usarlo para forzar su stone form y eliminar sus i-frames o derribarla cuando ultea para cancelarla.",
    "Knockdown también puede detener su ultimate apenas sube al aire, obligándola a cancelarla o caer inmediatamente.",
    "Slowing Hex puede evitar que ultee.",
    "Metal Skin y Disarming Hex funcionan bien contra su build de armas, dándote resistencia y ralentizándola.",
    "Contra Ivy espiritual, Silence Wave puede reducir su poder espiritual y silenciarla para impedirle usar stone form o esquivar tus habilidades.",
    "La habilidad clave de Ivy es su Stone Form: le permite esquivar casi cualquier cosa y suele ponerle puntos temprano para reducir su enfriamiento.",
    "Recuerda que puedes revisar el enfriamiento de Stone Form pasando el cursor sobre ella: por defecto 42 segundos, bajando a 23 si mejora la habilidad.",
    "Si Ivy no tiene Stone Form disponible, está relativamente vulnerable; aprovecha para castigarla.",
    "Capacitor es efectivo contra la build de armas de Ivy, ya que elimina sus tethers y puede limpiar efectos como Vampiric Burst o Heroic Aura.",
    "Capacitor también es útil si Ivy usa builds de alta velocidad o con habilidades de sustain, neutralizando su movilidad y curaciones."
    ] },
    { "name": "Kelvin", "tips": [], "counters": [    "En rangos medios o bajos, muchos Kelvin intentan golpear cuerpo a cuerpo dentro de su domo; prepárate para hacer parry si lo hace.",
    "Si Kelvin te encierra en su domo, mantén el dedo listo en el parry para responder a sus ataques cuerpo a cuerpo.",
    "Cuando Kelvin usa su rayo (beam), evita intercambiar daño directamente, ya que hace mucho daño.",
    "En ELOs bajos puedes usar heavy melee para cancelarle el beam, pero en niveles altos es mejor fingir el golpe o usar light melee para forzar su parry.",
    "Si Kelvin presiona parry, cancela su propio beam; puedes aprovechar eso para interrumpirlo fingiendo ataques cuerpo a cuerpo.",
    "El objetivo es hacerle cancelar su beam voluntariamente; usa feints o presión cercana para forzarlo.",
    "Evita tradear directamente cuando Kelvin tiene su beam activo; busca reposicionarte o esperar el cooldown.",
    "Los ítems con resistencia a ralentizaciones como Enduring Speed o Fleet Foot son muy buenos contra él.",
    "Enduring Speed ofrece resistencia a ralentización pasiva y es útil en general; Fleet Foot brinda esa resistencia de forma activa.",
    "Todo tipo de reducción de debuff o resistencia a efectos negativos ayuda, ya que casi todas las habilidades de Kelvin aplican slow.",
    "El beam de Kelvin acumula stacks de ralentización, así que tener una forma de limpiar debuffs puede salvarte cuando llegas a stacks máximos.",
    "Knockdown es muy efectivo para cancelar su beam con un aturdimiento directo.",
    "Kelvin de alto nivel suele contrarrestar esto con Counter Spell, pero igual le interrumpes el beam, lo cual sigue siendo valioso.",
    "El anti-heal es clave: compra Heal Bane temprano para evitar que se cure a sí mismo y a su equipo dentro del domo.",
    "En juego tardío, Spirit Burn o cualquier anti-heal en área son muy útiles para negar sus curaciones dentro del domo o en sus granadas.",
    "Spirit Shielding es muy bueno contra Kelvin porque su daño espiritual se mantiene sostenido y prolongado.",
    "Normalmente Spirit Shield solo vale la pena si hay dos enemigos de daño espiritual, pero con Kelvin es útil incluso si es el único.",
    "Spirit Shield ayuda a mitigar su daño sostenido, ya que sus ralentizaciones hacen que los intercambios se alarguen y te debilites progresivamente.",
    "Kelvin busca alargar los intercambios de daño: cuanto más duran, más lento te vuelves y más control obtiene sobre ti.",
    "Su habilidad clave es Ice Beam: si la tiene activa, nunca trates de enfrentarlo directamente.",
    "Cuando Kelvin no tiene Ice Beam disponible, es el mejor momento para tradear o presionarlo.",
    "El cooldown base de Ice Beam es de 25 segundos, reduciéndose a 18 si invierte puntos en ella.",
    "Puedes revisar si Kelvin mejoró su Ice Beam mirando sus habilidades en el HUD enemigo.",
    "Piensa en su Ice Beam como una habilidad de entre media y una ola de cooldown; aprovecha las ventanas cuando no la tiene disponible."
  ] },
    { "name": "Lady Geist", "tips": [], "counters": [
        "Asume siempre que Lady Geist tiene su ultimate disponible, a menos que hayas confirmado visualmente que no la tiene.",
    "El ícono de ojo bajo el retrato del personaje muestra si tiene su ultimate cargado; si está lleno, significa que puede usarla.",
    "Evita enfrentarte a Geist cuerpo a cuerpo o a corta distancia si tiene su ultimate disponible.",
    "Si no estás seguro de si tiene ultimate, juega a distancia segura y no te expongas.",
    "Comunica a tu equipo cuándo Geist tiene o no su ultimate; por ejemplo, 'Geist sin ult' o 'Geist tiene ult' ayuda muchísimo.",
    "Si Geist está a 1 de vida y se esconde detrás de una esquina, avisa a tu equipo diciendo 'Geist 1 HP con ult escondida' para evitar emboscadas.",
    "El mejor ítem contra Geist es Silence Wave, ya que evita que use su ultimate o habilidades cuando está silenciada.",
    "Si está por 30% de vida y crees que va a usar ultimate, silénciala y elimínala rápidamente.",
    "Si estás bajo de vida, usar Silence Wave también puede salvarte, impidiendo que te remate con ultimate.",
    "Debuff Remover es muy útil para quitar sus acumulaciones de daño amplificado (malice) o su drenaje de vida (life drain).",
    "El debuff remover puede cancelar directamente su habilidad de drenaje de vida, deteniendo tanto el daño como su curación.",
    "Counter Spell es excelente contra ella, especialmente para bloquear su bomba o incluso su ultimate si reaccionas a tiempo.",
    "Su bomba es predecible: la lanza, espera un segundo y luego explota; puedes bloquearla fácilmente con Counter Spell.",
    "En niveles bajos es más fácil anticipar cuándo Geist usará su ultimate; si se gira o salta hacia ti, prepárate para usar Counter Spell.",
    "Con buen tiempo, Counter Spell puede negar completamente su ultimate y cambiar el resultado del combate.",
    "Spell Break es muy efectivo si Geist con build de bombas domina la partida, ya que bloquea gran parte del daño explosivo.",
    "Spell Break también ofrece resistencia a debuffs, reduciendo la duración de su drenaje de vida y sus stacks de malicia.",
    "Cualquier ítem con anti-heal funciona bien, ya que Geist obtiene mucha curación de su habilidad de drenaje.",
    "El anti-heal no afecta cuánta vida intercambia con su ultimate, pero sí limita la curación que obtiene de sus otras habilidades.",
    "Mantente atento a su bomba (Bomb): suele usarla para controlar zonas o iniciar combates; tiene un cooldown de medio wave aproximadamente (10–15 segundos).",
    "Su habilidad más peligrosa es Life Drain: le permite ganar la mayoría de los intercambios si te mantiene en su línea de visión.",
    "Si colocas una pared entre tú y Geist mientras te drena, el daño y la curación se cancelan.",
    "Life Drain tiene un cooldown de unos 30 segundos (una wave). Cuando no la tiene disponible, es mucho más vulnerable.",
    "Incluso cuando está baja de vida, si tiene Life Drain activa sigue siendo peligrosa por la gran curación que obtiene."
    ] },
    { "name": "Lash", "tips": ["No juegues Lash"], "counters": [    
    "Juega alrededor de coberturas aéreas y estructuras como puentes o pilares para evitar su Ground Strike.",
    "Si ves a Lash preparar un Ground Strike, salta sobre una estructura elevada para evitar el impacto.",
    "Si domina caer encima de estructuras, cambia de posición para que falle el aterrizaje.",
    "Evita intentar esquivar Ground Strike solo con doble salto; usa rebotes en pared para ganar más altura. Mantente en el aire el mayor tiempo posible; trata el suelo como lava hasta tener cobertura o ayuda.",
    "El ítem Knockdown es excelente contra él: cancela su ultimate si lo lanzas justo antes de que recastee.",
    "Aplica Knockdown cuando salte o se mueva entre enemigos; cuanto más alto cae, más dura el aturdimiento.",
    "Slowing Hex anula completamente su Grapple; úsalo cuando entre para inmovilizarlo.",
    "Comunica al equipo si lo inmovilizas: 'Lash slowing hex, sin movimiento' para concentrar daño.",
    "Silence Wave también es útil: cancela su preparación de ultimate o evita que vuelva a subir con Grapple.",
    "Si lo ves prepararse para ult, usa Silence Wave antes de que lo active para hacerlo caer.",
    "Counter Spell es un excelente ítem: úsalo justo cuando active su pull para devolverlo.",
    "Practica el tiempo de Counter Spell, activándolo justo al final de su canalización.",
    "También puedes usar Counter Spell cuando veas aparecer el cono azul del Ground Strike para negar el daño.",
    "Si fallas el tiempo, aún puedes usarlo después de golpear el suelo para reducir el daño recibido.",
    "Si te lanza hacia una torre, prepara un parry justo al caer para bloquear el golpe del guardián.",
    "Si su ultimate no tiene stun, el parry tras tocar el suelo negará el daño de la torre.",
    "Spellbreak reduce el daño de su Ground Strike en un 75%, útil si abusa de esta habilidad.",
    "Lash experimentado puede usar su Flog antes del Ground Strike para mitigar Spellbreak.",
    "Flog tiene 30 segundos de enfriamiento; su daño es menor que su capacidad de curarse.",
    "Evita pelear cerca de aliados cuando tenga Flog disponible; puede curarse golpeando a ambos.",
    "Si falla Flog o la usa mal, castígalo en la siguiente oleada, cuando no tenga curación.",
    "Su Grapple (habilidad dos) es más clave que Flog: tiene 42 segundos de enfriamiento y le da movilidad.",
    "Sin Grapple, es mucho más vulnerable y no puede escapar fácilmente.",
    "Controla el enfriamiento de su Grapple para aprovechar su ventana de debilidad.",
    "Aprovecha cuando no tenga ni Grapple ni Flog para forzar intercambios o eliminaciones.",
    "Los Lash agresivos en líneas laterales suelen usar Ground Strike desde invisibilidad; anticípalo con rebotes o Knockdown."] },
    { "name": "McGinnis", "tips": [], "counters": [
    "Presta mucha atención a tu posicionamiento, ya que su muro castiga fuertemente los errores de posición.",
    "Juega alineado con tu compañero de línea; evita adelantarte demasiado si tu laner está jugando pasivo.",
    "Cuando limpies oleadas, hazlo a distancia; no te acerques demasiado a la wave si el muro está disponible.",
    "Si es una McGinnis de build espiritual, destruye sus torretas siempre que puedas antes de que se acumulen.",
    "Usa habilidades con daño en área (como Ground Strike o Dorm Bell) para limpiar torretas rápidamente.",
    "Contra build de arma, evita intercambios largos; su arma tarda en cargarse, pero gana mucho daño con el tiempo.",
    "Haz intercambios cortos de 2 segundos y retrocede antes de que su arma alcance su máxima cadencia.",
    "Warpstone es excelente para contrarrestarla: te permite saltar o escalar su muro fácilmente.",
    "No puedes hacer wall jump en su muro, pero sí puedes rebotar desde otro muro cercano y luego doble salto para pasarlo.",
    "Si no hay otro muro disponible, usa Warpstone directamente para escapar o cruzar.",
    "Enduring Speed es muy útil contra ella, ya que sus torretas y muro aplican ralentización.",
    "Cualquier ítem que otorgue resistencia a ralentización es valioso para escapar de su línea de torretas.",
    "Si usa build espiritual, Knockdown es clave: cancela su ultimate al interrumpir la canalización.",
    "Cuando veas que comienza su ultimate con muro + combo, lanza Knockdown para anular todo su daño.",
    "Contra build de arma, Return Fire o Metal Skin son excelentes; la obligan a dejar de disparar y reducen su DPS.",
    "Return Fire otorga 6 segundos de mitigación, Metal Skin 3; ambos sirven para ganar tiempo hasta que tu equipo cruce el muro.",
    "Su habilidad clave es el muro: tiene 50 segundos de enfriamiento (equivalente a dos oleadas).",
    "Evita errores de posicionamiento cuando su muro esté disponible, ya que puede aislarte del equipo.",
    "Cuando su muro esté en enfriamiento, es mucho menos peligrosa y tiene solo dos puntos de stamina para escapar.",
    "Aprovecha los momentos sin muro para empujar oleadas o castigarla sin riesgo de ser separada del equipo."
    ] },
    { "name": "Mina", "tips": [], "counters": [
    "Monitorea sus Love Bites; evite acercarte cuando sus stacks estén altos, especialmente al 70% o más.",
    "No entres en intercambios largos de pistola; realiza trades cortos tipo guerrilla para pokear y retirarte.",
    "Cuando use su habilidad 2 para saltar al aire, prepárate: casi siempre seguirá con su ultimate.",
    "Juega cerca de cobertura; sus Love Bites desaparecen rápido si evitas el contacto y te proteges detrás de objetos.",
    "Debuff Remover es útil para limpiar sus stacks de Love Bite y reducir su daño explosivo.",
    "Knockdown puede forzarla a usar su habilidad 2 o castigarla después de usarla, dejándola vulnerable.",
    "Spirit Shielding ayuda a sobrevivir su burst y ultimate, especialmente si estás en una línea doble de espíritus.",
    "Slowing Hex es excelente; bloquea su habilidad 2 y previene escapes o setups de ultimate.",
    "Si su habilidad 2 está en cooldown (27 segundos early game), es extremadamente vulnerable y fácil de castigar.",
    "Controla la distancia durante el early game para evitar que procione sus Love Bites y reduzca su capacidad de presión."
    ] },
    { "name": "Mirage", "tips": [], "counters": [
    "Juega alrededor de su Tornado; no uses tus habilidades clave cuando él pueda activarlo para esquivarlas.",
    "Evita colocar bombas o usar CC sobre él mientras su Tornado esté activo, ya que puede evadirlo fácilmente.",
    "Al igual que Mina, controla la distancia y espera a que gaste su habilidad 2 antes de comprometer tu kit completo.",
    "Slowing Hex es excelente para su habilidad 2; impide que pueda evadir tus habilidades clave.",
    "Debuff Remover ayuda a eliminar sus marcas y reducir el daño recibido de sus stacks de scarabs.",
    "Capacitor puede eliminar su invulnerabilidad durante el Tornado, y Armor Piercing Rounds atraviesa su evasión de Tornado.",
    "Restorative Locket es útil para acumular stacks cada vez que él usa scarabs o su habilidad 1, aumentando tu recuperación posterior.",
    "Su habilidad clave es el Tornado: 32 segundos de cooldown, 18 si tiene 2 puntos. Evalúa cuántos puntos tiene para planear tus trades.",
    "Observa visualmente los niveles de sus habilidades: sin nivel no tiene adornos, 1 punto = círculo roto, 2 puntos = pequeños picos, max = círculo completo con picos.",
    "Evita usar habilidades duras mientras su Tornado pueda esquivarlas; espera a que se gaste para maximizar tu daño."
    ] },
    { "name": "Mo & Krill", "tips": [], "counters": [
        "Usa la verticalidad para contrarrestar su burrow. Si lo ves enterrarse buscando un intercambio, salta sobre puentes u objetos elevados; mientras no tenga Warpstone, no podrá alcanzarte. Esto es especialmente útil en la fase de líneas, donde su daño temprano puede ser sorprendente si te posicionas mal.",
    "Si eres un personaje frágil, mantente cerca de tu front line y presta mucha atención a tu posicionamiento. Si te ultéan repetidamente, generalmente es culpa de estar demasiado expuesto. Compra objetos de movimiento como Warpstone o Stamina Master para esquivar su ultimate o mantener distancia segura.",
    "Anti-Heal es un ítem clave contra él. Sus habilidades y su ultimate le permiten curarse, y objetos como QSR o Mythic Burst aumentan estas curaciones. Comprar Anti-Heal temprano reduce significativamente su sostenimiento y te permite ganar trades más seguros en línea y peleas de equipo.",
    "Debuff Remover y debuff reduction son muy útiles para mitigar sus efectos de Scorn y los debuffs que aplica con su ultimate. Si eres de backline, a veces es más efectivo enfocarse en movimiento para evitar ser objetivo, pero estos ítems siguen siendo valiosos para reducir daño y controlar su impacto.",
    "Tank Buster y Toxic Bullets funcionan muy bien contra él debido a su alto máximo de vida, especialmente cuando escala en mid-late game. Estos ítems permiten reducir su capacidad de aguantar en peleas largas y facilitar que tu equipo lo elimine más rápido.",
    "Knockdown es muy eficaz para interrumpir su burrow o ultimate. Esto lo deja vulnerable y permite castigar sus errores de posicionamiento. Además, Armor Piercing Rounds y Capacitor son opciones situacionales que pueden atravesar su resistencia de balas mientras está en burrow, aumentando tu daño efectivo.",
    "Headshot Booster es excelente contra él y Seven debido a sus grandes hitboxes de cabeza. Permite infligir un daño consistente y confiable, ideal para personajes que pueden aprovechar los headshots de forma constante.",
    "Su habilidad clave es Sand / Burrow. Para gun characters, Sand tiene un cooldown de 42 segundos (18 segundos si se maxea). Vigila esta habilidad para evitar desarmes o robos de souls inesperados. Para spirit characters, Burrow tiene 37 segundos de cooldown y es una herramienta ofensiva importante; cuando no está disponible, Mo & Krill se vuelve mucho más vulnerable, lo que ofrece oportunidades de gank o castigo durante la fase de líneas."
    ] },
    { "name": "Paige", "tips": [], "counters": [
    "Enfócate completamente en Paige siempre que la veas; es muy frágil y se derrite rápidamente si la atacas.",
    "Aprovecha cualquier error de posicionamiento; si camina demasiado adelante, castígala inmediatamente.",
    "Su habilidad tres (root) es su mayor amenaza, Counter Spell puede negarla eficazmente.",
    "Reactive Barrier ayuda a sobrevivir sus combos, Spirit Shielding protege contra daño sostenido.",
    "Movilidad es clave: Warpstone, Phantom Strike, Slowing Bullets o Slowing Hex te permiten acercarte y castigarla.",
    "Capacitor elimina sus escudos y habilidades de protección aliada.",
    "Su barrier tiene 26 segundos de cooldown y normalmente es su primera habilidad, cambia el curso de la pelea.",
    "Captivating Read es otra habilidad clave; administra tu stamina para no quedar atrapado en combos.",
    "Si no tiene barrier ni root, es mucho más fácil eliminarla en intercambios cortos.",
    "Aprovecha la ventana sin root para usar tus habilidades fuertes y CC sin riesgo.",
    "En el juego temprano, su movilidad es limitada; controla los espacios y presiónala constantemente."
    ] },
    { "name": "Paradox", "tips": [], "counters": [
    "Usa audífonos para escuchar su Carbine; si la oyes activarla, cúbrete y espera que pase, no te expongas mientras dure.",
    "Warpstone es excelente contra su Carbine ult; te permite escapar inmediatamente y esquivar gran parte de su daño.",
    "Spellbreak reduce hasta un 75% del daño de builds full Carbine, ideal contra Paradox agresiva.",
    "Debuff Remover limpia los efectos de sus bombas, incluyendo el porcentaje de daño extra que aplican.",
    "Reactive Barrier y Spirit Scaling ayudan a sobrevivir sus combos y el daño sostenido de mid/late game.",
    "Presta atención a su Time Wall; es peligrosa y puede bloquear gran parte del daño y controlar espacios en team fights.",
    "Juega alrededor de los cooldowns de sus habilidades; evita comprometerte mientras Carbine o Time Wall están activos.",
    "Mantente en posiciones que dificulten que Paradox maximice el daño de sus bombas o su ult, especialmente en base o team fights agrupadas.",
    "Si ves que está lanzando affliction ultimate con Pocket, aléjate de agrupamientos y prepárate para reaccionar con CC o movilidad.",
    "En lane, la prioridad es jugar seguro contra Carbine y aprovechar ventanas donde no tenga sus habilidades disponibles."
    ] },
    { "name": "Pocket", "tips": [], "counters": ["No te agrupes en late game. Pocket castiga equipos apretados con su salto, affliction y ultimate. Mantén siempre espacio y visión para que no te elimine a todo el grupo de una sola jugada.",
    "Aprovecha cuando no tenga habilidades. Si gasta su Cloak o Case, es tu momento para saltarle encima. En ese estado queda sin movilidad y puede morir muy rápido si lo focuseas junto a tu aliado.",
    "Evita pararte junto a tu laner. Pocket aprovecha cualquier oportunidad para golpear a dos enemigos juntos y salir ileso. Mantén una pequeña distancia en línea para reducir su daño y presión.",
    "Usa Slowing Hex. Este ítem es excelente contra Pocket porque impide que recastee su Cloak. Si lo lanzas justo después de que lo use, quedará atrapado sin poder escapar.",
    "Compra Divine Barrier. Esta herramienta limpia efectos de definitivas, incluida la de Pocket. Si un compañero cae en su ult, activa el escudo y lo liberarás, arruinando su intento de reinicio.",
    "Reduce la duración de su ult con objetos de reducción de debuffs como Blood Tribute. Cortar el tiempo de su definitiva evita que alargue peleas o fuerce retiradas tras iniciar.",
    "Practica el counter spell. Si logras reflejar o negar su ultimate, eliminas gran parte de su valor. Requiere práctica, pero es la forma más efectiva de neutralizarlo en duelos.",
    "Castígalo tras su Case. Ese es su núcleo de daño y defensa. Si lo usa de forma ofensiva o sin Cloak, coordina control y burst con tu laner para eliminarlo antes de que recupere recursos."] },
    { "name": "Seven", "tips": [], "counters": [ "Cuando Seven use su definitiva antes de mejorarla, posiciónate en ángulo. Así podrás dispararle directamente sin que sus rayos te alcancen. Esto lo obliga a cancelar el ult o recibir una cantidad enorme de daño mientras no puede moverse.",
      "Compra Knockdown. Este ítem cancela su ultimate y lo fuerza a gastar recursos en Unstoppable si quiere mantenerla. Obligarlo a comprar eso debilita su build y acorta la duración de su tormenta, reduciendo mucho su impacto en peleas.",
      "Counter Spell es excelente contra Seven. Si lo activas justo antes de que te impacte su aturdimiento, lo niegas completamente y te libras de una de las partes más peligrosas de su combo, especialmente en el late donde la duración del stun aumenta.",
      "Un Debuff Remover también sirve para limpiar su stun si prefieres una opción más directa. Si eres soporte, Divine Barrier puede usarse para liberar a tus aliados de su control en medio de la pelea.",
      "Cualquier ítem que reduzca la velocidad de ataque funciona muy bien contra Seven. Su daño depende mucho de la cadencia de su Power Surge, por lo que disminuirla lo vuelve mucho menos efectivo en intercambios largos.",
      "Si evitas su stun, frenas gran parte de su daño. Si además lo ralentizas, sus habilidades pierden ritmo y puedes presionarlo sin arriesgarte a que responda con un combo completo.",
      "En línea, observa su habilidad Power Surge. Tiene un enfriamiento largo, y cuando la usa, queda sin buena parte de su daño. Si la gasta en limpiar oleadas o falla el tiro, es tu momento de entrar agresivo y forzarle intercambios."
    ]
  },
    { 
      "name": "Shiv",
      "tips": [],
      "counters": [
        "Espacia su dash. Shiv depende completamente de su dash para entrar en combate o acercarse a ti. Si mantienes la distancia o lo obligas a fallarlo, pierde gran parte de su movilidad y queda muy vulnerable. Forzarlo a usar su dash sin resultado es una de las mejores formas de debilitarlo.",
        "Monitorea su nivel de ira. Cuando el orbe en su cintura brilla, significa que está cargado y hará mucho más daño. Evita pelear cuando tiene ira completa y, si puedes, retrasa el enfrentamiento hasta que la pierda empujando la oleada o retirándote un momento.",
        "Usa Slowing Hex para detener su avance. Si ves que se lanza hacia ti, activa Slowing Hex para ralentizarlo y ganar tiempo. Esto corta gran parte de su ofensiva y te permite reposicionarte o escapar.",
        "Counter Spell es una herramienta clave contra su ultimate. Si logras activarla justo cuando inicia su ulti, la cancelas por completo y lo dejas en enfriamiento, dándole una enorme ventaja a tu equipo. Además te cura y te da velocidad de movimiento para escapar o contraatacar.",
        "Compra anti-heal si Shiv se arma con leech o infuser. Cortar su curación es esencial, ya que depende mucho de la regeneración para sobrevivir durante los combates largos.",
        "Usa Debuff Remover si está yendo por una build de cuchillos. Limpiar su sangrado anula prácticamente todo el daño prolongado de ese estilo de juego y lo deja sin presión sostenida.",
        "Evita perseguirlo por pasillos estrechos. Muchos jugadores mueren persiguiendo a un Shiv con poca vida, pero con sus dashes y robo de vida puede girarse y eliminar a varios enemigos de golpe. Dale espacio y no te sobreextiendas.",
        "Recuerda que su dash tiene un enfriamiento de unos 14 segundos. Si lo gasta y no conoce las técnicas avanzadas de movimiento, queda sin movilidad. Aprovecha ese momento para castigarlo o forzar un enfrentamiento antes de que lo recupere."
      ]
    },
    { "name": "Doorman", "tips": [], "counters": [    "Salta su carro para esquivarlo fácilmente; cambiar tu momentum también ayuda a evadirlo.",
    "Si empieza a lanzar su carro desde cualquier distancia, ajusta tu posición para evitar ser alcanzado.",
    "Si está usando su ult en un aliado, aplica CC rápido si tu personaje lo permite para interrumpirlo.",
    "Antes de que tenga dos puntos en su ulti, no es imparable; puedes interrumpirlo y evitar que elimine a un aliado.",
    "Reactive Barrier es útil porque se activa tanto al recibir daño del carro como al ser golpeado por su ulti, mitigando mucho daño.",
    "Counter Spell al momento de su ulti puede negar completamente el daño y dejarte fuera de peligro inmediatamente.",
    "Si alguien intenta meleearte mientras él está cerca, Counter Spell o Reactive Barrier puede bloquear su burst inmediato.",
    "Debuff Reduction es clave si él va build de Echo Shard, para reducir la duración de sus chain carros.",
    "Movilidad extra (boots, warp stone, arcane surge, kinetic dash, stamina mastery) es muy útil para salir rápido de su ulti y regresar a la pelea.",
    "Su habilidad clave en lane es su Hotel Guest, con cooldown de 40s; conocer cuándo está disponible es importante para evitar poke y agresiones.",
    "Cuando maxea su carro, el cooldown se reduce a 30s, usualmente más cerca de 23s si tiene reducción de CD; perderlo o fallarlo lo deja vulnerable.",
    "Si falla su carro o ulti, su capacidad de curación y setup de combos se ve muy limitada; aprovecha para presionarlo."] },
    { "name": "Sinclair", "tips": [], "counters": [ "Evita que tome el control del puente o zonas elevadas. Sinclair depende del dominio de altura para ganar prioridad de oleada y presionar con sus proyectiles. Mantenerlo fuera de estas posiciones limita fuertemente su capacidad de daño y control de línea.",
      "Cuando lance sus proyectiles, salta o haz dash en el momento del recasteo. Un doble salto o un salto con rebote de pared puede hacer que falle sus disparos. Alternar movimientos verticales y diagonales lo obliga a errar y reduce su presión constante.",
      "Comunica siempre cuando robe una ultimate. Si roba la de un aliado como Dynamo o Lash, avisa de inmediato que tiene esa habilidad. Las copias duran solo 12 segundos, así que retrocede, espera, y luego reengánchate cuando se acabe para castigar su vulnerabilidad.",
      "Usa reducción de desventajas (debuff reduction) para acortar la duración del ‘bunny’. Aunque ya no es común el Sinclair cuerpo a cuerpo, este tipo de mitigación sigue siendo útil contra su control.",
      "Counter Spell funciona muy bien contra él. Sus proyectiles son predecibles y puedes reflejarlos fácilmente, además de poder contrarrestar su ‘bunny’ gracias al largo tiempo de preparación que tiene.",
      "Si está muy por delante en daño, Spell Break es ideal. Reduce drásticamente el impacto de sus proyectiles y te permite sobrevivir sus ráfagas sin tener que esquivar todo.",
      "Silence Wave puede evitar que use ultimates robadas o que robe una en primer lugar. Si ves que apunta a copiar una habilidad importante, lánzale Silence Wave para suprimirlo antes de que lo logre.",
      "Reactive Barrier es útil en línea: se activa al ser ‘bunnied’ y te da tiempo para resistir el combo de control y proyectiles dobles que suele seguir a esa habilidad.",
      "Slowing Hex impide que se teletransporte a su asistente espectral. Si lo usa para emboscar o flanquear, aplica Slowing Hex y elimínalo antes de que pueda reposicionarse.",
      "La habilidad más importante de vigilar es su Asistente Espectral. Tiene un enfriamiento de unos 40 segundos y le duplica la capacidad de daño con proyectiles. Cuando lo use, juega defensivo y espera a que expire (6 a 13 segundos según nivel) antes de intentar intercambiar daño."
    ] },
    { "name": "Victor", "tips": [], "counters": [
      "Controla siempre tu stamina en línea. Mientras mantengas algo de reserva para moverte o escapar, Victor no será una gran amenaza. Si gestionas bien tu movilidad y haces rebotes de pared, puedes evitar que se te acerque y te derrita a corta distancia.",
      "Juega alrededor de esquinas y usa fintas para hacerle gastar su habilidad principal. Simula un movimiento agresivo y luego escóndete tras una cobertura para forzar su disparo y castigarlo cuando falle.",
      "Fuera de línea, evita enfocarlo en peleas de equipo. Victor quiere absorber habilidades y distracciones para que sus aliados inflijan daño. Ignóralo y elimina primero a sus compañeros de equipo o a los personajes con daño principal.",
      "Revisa constantemente el indicador de ultimate sobre su barra. Si tiene su ultimate disponible, no te comprometas en intercambios directos. Espera a que la use o fuerza que la gaste antes de pelear en serio.",
      "Warpstone y Enduring Speed son esenciales contra él. Mantenerte fuera de su rango y evitar su área de control es la forma más efectiva de contrarrestarlo. Cualquier ítem de movilidad te permitirá reposicionarte cuando intente acorralarte.",
      "Capacitor o Curse apagan su habilidad número tres, reduciendo su DPS sostenido. Interrumpirla en medio de un combate prolongado corta drásticamente su daño acumulativo.",
      "Aplica anti-curaciones constantemente. Healbane y Toxic Bullets son los mejores porque pueden renovarse fácilmente, lo que limita su regeneración pasiva y autosostenimiento durante las peleas.",
      "Evita usar Spirit Burn, ya que Victor puede limpiarlo fácilmente con su habilidad dos. En su lugar, opta por efectos persistentes que lo mantengan debilitado sin depender de una única aplicación.",
      "Restorative Locket te da stamina adicional para mantener movilidad constante. Tener siempre recursos para esquivar o alejarte de él marca la diferencia entre vivir y ser eliminado.",
      "Silence Wave es muy eficaz cuando está bajo de vida. Si lo silencias alrededor del 30 % de HP, evitarás que use sus curaciones o escapes, permitiéndote asegurar la eliminación.",
      "Durante la fase de línea, vigila su habilidad dos. Tiene un enfriamiento de 22 segundos y puede acumular hasta dos cargas. Si las tiene disponibles, dispone de entre 200 y 400 puntos de curación instantánea y un aumento de velocidad que le permite escapar fácilmente.",
      "Si planeas emboscarlo o iniciar un intercambio, espera a que use sus dos cargas de curación. Entrar cuando las tenga disponibles suele resultar en una pérdida de tiempo o en que logre sobrevivir sin esfuerzo.",
      "Su Pain Battery no tiene un enfriamiento temporal fijo, sino que depende del daño recibido. Si notas que empieza a jugar más agresivo, probablemente ya esté cargada. Evita darle daño gratuito durante ese tiempo, o esperará el momento perfecto para usarla y girar el combate a su favor."
    ] },
    { "name": "Vindicta", "tips": [], "counters": [
    "Siempre retrocede cuando tengas poca vida, no intentes quedarte en línea para ganar una ola si estás al borde de la muerte. Exponerte demasiado solo le da a Vindicta oportunidades de conseguir bajas fáciles y aumentar su control del mapa. Mantenerte saludable y saber cuándo retirarte es mucho más importante que intentar forzar enfrentamientos arriesgados.",
    "Usar items que te mantengan con vida, como regeneración o curas, es clave en la fase de líneas. Esto evita que caigas en su umbral de ejecución y te permite sostener tu presencia en el juego. La prioridad es siempre conservar tu salud para que no te conviertas en un objetivo fácil para su daño elevado.",
    "Spell break es muy efectivo contra su snipe, ya que reduce su daño significativamente y puede salvarte la vida en múltiples situaciones. Si te golpea repetidamente con disparos desde la distancia, tener esta herramienta te permite absorber esos ataques sin morir inmediatamente y te da margen para reaccionar o contraatacar.",
    "Knockdown es útil para neutralizar su capacidad de vuelo. Al derribarla mientras está en el aire, la mantienes aturdida por tiempo prolongado, lo que te da control y evita que haga jugadas agresivas. Esta mecánica es especialmente efectiva porque su movilidad aérea es uno de sus principales recursos ofensivos.",
    "Reactive funciona bien porque se activa cuando usa su stake, lo que te da un margen de seguridad adicional al lidiar con su daño explosivo. Este tipo de items defensivos permite que la fase de línea sea más manejable y reduce su capacidad de eliminarte de un solo golpe.",
    "Monitorea tanto su crow como su stake durante la línea. Crow inflige daño constante y aplica efectos de sangrado que aumentan el daño que recibes, mientras que stake es su habilidad de ejecución principal. Saber cuándo están disponibles te permite posicionarte mejor y minimizar el riesgo de recibir daño significativo.",
    "En general, la clave contra Vindicta es no exponerte innecesariamente, mantener control de tu salud, y usar items defensivos y de control que mitiguen su daño y movilidad. Si juegas de manera disciplinada y evitas errores graves, su impacto en el juego se reduce considerablemente."
    ] },
    { "name": "Viscous", "tips": [], "counters": [
    "Negarle el control del terreno elevado es una de las formas más efectivas de contrarrestar a Viscus. Si logras empujar la oleada y evitar que tome posiciones altas como puentes o plataformas, sus combos de Skinner y su habilidad Splatter se vuelven mucho menos precisos y peligrosos. Viscus depende mucho de tener visión y ángulo desde arriba para conectar ataques consecutivos, así que mantenerlo en terreno plano o bajo limita drásticamente su capacidad de presión y su daño constante en las peleas.",
    "Cuando Viscus activa su definitiva, la mejor respuesta es aprovechar la movilidad del personaje que controles. Saltar doble o realizar un wall jump puede esquivar el daño directo, y un buen jugador de Viscus intentará predecir tus movimientos para alcanzarte con un doble salto propio. Sin embargo, esta predicción lo deja vulnerable, ya que pierde control direccional. Si logras forzarle esos saltos, puedes deslizarte debajo o rodar a los costados, aprovechando el momento en que su movilidad aérea está comprometida. Subir a una posición elevada también te da margen para sobrevivir mejor al ult y evitar daño directo.",
    "Parar su ataque “puddle punch” con un parry es una habilidad crucial que aumenta mucho tu supervivencia. Si logras activar el parry justo antes de que el golpe impacte, bloqueas completamente el daño, y con práctica incluso puedes castigar a Viscus después del intercambio. Aprender a anticipar el ritmo de su combo requiere práctica, idealmente entrenando con un amigo, ya que no todos los jugadores de Viscus ejecutan las combinaciones avanzadas como las de Skinner. Los más comunes lanzarán primero un Splatter y luego buscarán conectar el Puddle Punch, por lo que al ver el Splatter puedes preparar el parry para interceptar su siguiente movimiento.",
    "En cuanto a ítems, Viscus tiene pocos counters directos, pero algunos objetos resultan muy útiles. Spirit Shielding ofrece protección adicional contra su daño, mientras que Capacitor resulta excelente si juega con un estilo de soporte, ya que puedes eliminar completamente su “cube” o burbuja de protección al activarlo. Este objeto es clave para anular su utilidad en equipo. Close Quarters mejora tu resistencia al daño cuerpo a cuerpo, lo cual es valioso frente a su Puddle Punch. Además, Rebuttal puede reflejar daño si logras pararle un golpe, lo que convierte la defensa en una oportunidad ofensiva. Finalmente, Armor Piercing Rounds ayuda a atravesar la resistencia que gana con su ultimate, la cual le otorga un 60% de reducción de daño físico y espiritual; este ítem permite que tus disparos sigan siendo efectivos incluso mientras está transformado.",
    "Su habilidad más importante en línea es el “cube”, que otorga invulnerabilidad momentánea y puede colocarse tanto sobre él como sobre aliados para esquivar habilidades críticas o ataques letales. Este escudo tiene un enfriamiento de 42 segundos, por lo que observar cuidadosamente cuándo lo usa te da una ventana clara para atacar con todo mientras está desprotegido. La gestión de ese tiempo y la presión constante cuando no dispone de la habilidad marcan la diferencia entre mantenerlo controlado o dejarlo dominar las peleas."
    
    ] },
    { "name": "Vyper", "tips": [], "counters": 
   [
    "Usa la verticalidad para romper su juego: Viper depende mucho de sus deslizamientos para cerrar distancias y hacer plays agresivas, y esos movimientos no le permiten subir por superficies verticales. Si te posicionas en altura —por ejemplo saltando a la parte superior del puente en línea— la Viper se verá forzada a gastar stamina al deslizarse hacia abajo para alcanzarte y luego volver a subir, lo que reduce sus opciones ofensivas y la deja en desventaja posicional. Forzarle esos consumos de stamina repetidos no solo reduce su capacidad de iniciar, sino que también crea ventanas de oportunidad donde sus slides están en cooldown o está demasiado agotada para comprometerse, así que juega alrededor de escaleras, puentes y plataformas siempre que puedas para convertir su movilidad en una debilidad.",
    "Vigila y administra su stamina; explota cuando la pierda: controlar la barra de stamina de Viper es clave porque sin ella pierde la mayoría de sus herramientas de movilidad y escape. Si la observas iniciar un slide y quedarte por encima o sobre algún obstáculo, mantente en la verticalidad hasta que su stamina baje; cuando esté baja o vacía, sus slides y dashes serán mucho menos efectivos y será mucho más sencillo perseguirla o castigarla con intercambios largos. En resumen: no la dejes abusar constantemente de sus slides, acelera las peleas cuando notes que ha gastado stamina y evita quedarte expuesto cuando aún la tenga disponible.",
    "Prioriza objetos y efectos que reduzcan su movilidad o la ralentice: cualquier cosa que limite su distancia de dash o la capacidad de desplazarse con facilidad te da una ventaja directa, por ejemplo objetos/efectos de “slowing hex” que reducen su desplazamiento y hacen que sus slides lleguen a menos distancia. Asimismo, los efectos de knock-down o stun que rompen su movimiento y le impiden encadenar slides y burst son especialmente efectivos: aturdirla o inmovilizarla facilita enfocarla y matearla antes de que pueda huir. En general, cualquier build o ítem orientado a negar movimiento hará que sus entradas sean mucho más previsibles y castigables.",
    "Compra objetos defensivos y de limpieza de debuffs para sobrevivir al daño de su venom: Plated Armor reduce una porción significativa del daño de sus disparos y reduce el on-hit de venom que acumula; Return Fire puede darte un salvavidas cuando intenta entrar a burstearte y te da tiempo para sobrevivir el combo; Metal Skin y los fire rate slows mencionados ayudan también a mitigar su pico de daño. Además, Debuff Remover es muy valioso porque limpia su venom acumulado antes de que llegue a niveles letales, y Counter Spell funciona para interrumpir o predecir el fin de su venom si tienes la reacción suficiente; todos estos elementos combinados te permiten mantenerte en rangos de vida seguros contra su daño por tiempo y por impacto.",
    "Entiende la importancia de su venom y mantén tu HP alto; explota cuando no lo tenga: la habilidad clave de Viper en línea es su venom, con 20 segundos de cooldown, y su capacidad de infligir muchísimo daño en poke y en all-ins si consigue procs de mythic burst. En lane esto se traduce en un umbral de ejecución: si estás por debajo de aproximadamente 250 HP (considerando que ella tenga mythic burst), entras en rango donde un venom bien aprovechado puede eliminarte o dejarte extremadamente vulnerable. Por eso es esencial conservar healings, resetear si quedas bajo de vida y evitar trades riesgosos cuando ella tiene venom listo. Contrario a eso, si ves que acaba de lanzar su venom o lo usó en un aliado para conseguir un proc de mythic, ese es el momento ideal para lanzarte a un all-in porque le falta ese execute y su capacidad de burst disminuye notablemente."
  ]
  },
    { "name": "Warden", "tips": [], "counters": [
    "Cuando pelees contra Warden, especialmente en línea, es fundamental tener siempre un plan de escape. Anticipa cómo vas a salir si lanza su jaula, usa el entorno a tu favor con saltos o muros, y nunca te quedes atrapado sin stamina. Mantener rutas claras de retirada te salvará de muchos intentos de encierro.",
    "Administra tu stamina como si tuvieras una barra menos, ya que el frasco de Warden drena parte de tu energía al golpear. Trata de mantenerte por encima de la mitad de tu barra y no comprometerte a peleas largas si no tienes margen para escapar. Su control depende de dejarte sin movilidad, así que prioriza conservar stamina.",
    "Restorative Locket es un objeto excelente contra él. Más allá de su curación, te da dos barras extra de stamina que pueden marcar la diferencia entre morir o escapar. Si Warden te atrapa o activa su definitiva, usar el Locket te permitirá saltar o hacer dash fuera del peligro rápidamente.",
    "Debuff Remover es muy útil contra su build de jaula. Si Warden te atrapa dentro, al activarlo eliminarás el efecto y podrás salir sin problemas. Esto neutraliza su principal herramienta de control y te deja en ventaja si responde mal a tu liberación.",
    "Counter Spell también resulta muy efectivo, ya que puedes usarlo tanto contra su definitiva como contra la jaula justo al caer. Activarlo a tiempo te da uno o dos segundos extra que pueden ser decisivos para sobrevivir o reposicionarte antes de que te elimine.",
    "Los objetos como Enduring Speed o Debuff Remover ayudan a resistir sus ralentizaciones. La resistencia al slow que otorgan te permite moverte con más libertad y salir del rango de su jaula, especialmente útil si combina su control con ataques de seguimiento.",
    "Slowing hex es otra gran opción, ya que puedes lanzarlo sobre él cuando use su definitiva o intente perseguirte. Esto no solo frena su avance, sino que también ayuda a tus aliados a mantener distancia y castigar sus intentos de acercamiento.",
    "Finalmente, presta atención a su habilidad de barrera. Su ward le otorga 125 puntos de escudo y velocidad de movimiento, lo que lo vuelve más difícil de eliminar. Cuando sepas que esta habilidad está en enfriamiento, aprovecha ese momento para presionarlo, ya que estará más vulnerable y sin protección extra."
  ]
  },
    { "name": "Wraith", "tips": [], "counters": [
      "Cuando juegues contra Wraith, presta atención a sus cartas. El número de cartas sobre su barra de vida indica su potencial de burst, y mientras tenga varias cargadas es muy peligrosa. Haz daño cuando tenga cartas cargadas es más eficiente para ti y menos óptimo para ella, ya que la fuerza a usar cartas de forma defensiva o a distancia.",
    "Evita pelear cuando esté activando sus cartas. Es en ese momento donde su daño es más alto y sus intercambios son más efectivos. Mantente seguro y espera a que gaste sus cartas antes de comprometerte a un enfrentamiento directo.",
    "Items como Disarming Hex son muy útiles contra Wraith, ya que interrumpen su daño al teletransportarse sobre ti. Return Fire y cualquier efecto de slow en la velocidad de disparo también ayudan a mitigar su burst y limitar su efectividad ofensiva.",
    "Counter Spell funciona bien contra su ulti debido a su tiempo de preparación largo. Puedes activarlo con antelación o en reacción a la ulti para bloquear su efecto y ganar unos segundos valiosos de supervivencia. Divine Barrier es otra opción si sus ataques amenazan a tus compañeros o a ti directamente.",
    "Slowing hex es excelente para controlar sus TP. Al usarlo en momentos de sobreextensión o split, bloqueas su movilidad por 3.5 segundos, lo que crea oportunidades para castigarla o reposicionarte antes de que vuelva a entrar al combate.",
    "Monitorea siempre sus cartas en línea y también su habilidad Full Auto. Esta tiene cooldown de 48 segundos (34 con puntos invertidos) y aumenta significativamente su daño con fire rate y daño por proyectil. Saber cuándo la tiene activa te permite anticipar su potencial y castigar sus movimientos, tanto a ella como a sus aliados."
    ] },
    { "name": "Yamato", "tips": [], "counters": [
        "Contra Yamato, respeta su fuerza en línea. Es uno de los mejores laners del juego y busca snowballear su ventaja. Si te mata o consigue presión, juega de forma segura, prioriza farmear minions y mantener tu torre viva, y compra objetos defensivos o regenerativos como Monster Rounds y Restoot para sobrevivir su daño sin forzar intercambios.",
    "Su Power Slash y ataques básicos son muy fuertes en línea. Si se especializa en técnicas como slide Power Slash o mantle Power Slash, pueden ser muy opresivas. Mantente saludable con items de sustain y evita morir; es preferible construir defensivamente a forzar trades arriesgados, porque si la retrasas en línea, su impacto en el juego disminuye significativamente.",
    "Counter Spell es efectivo contra su habilidad uno, que tiene un canal largo y es predecible. Activarlo al inicio de su canal te permite bloquear gran parte de su daño, incluyendo durante su ultimate si reaccionas rápido. Esto puede negar gran parte de su potencial de burst.",
    "Armor Piercing Rounds funciona bien contra ella debido a sus altas resistencias en ultimate. Como personaje de proyectil, usar APR permite infligir mucho más daño del que aparenta, reduciendo la efectividad de sus defensas y maximizando tu burst sobre Yamato.",
    "Silence Wave es excelente para interrumpir su combo y ultimate. Usarlo cuando está alrededor de 50% HP y prepara su ulti puede silenciarla por 3.25 segundos, tiempo suficiente para que tu equipo la elimine antes de que se cure o use todas sus habilidades.",
    "Warpstone ayuda a escapar de su agresión y a esquivar Power Slash o su ultimate si la activas en el momento adecuado. Esto te permite reposicionarte, sobrevivir más tiempo y reducir el riesgo de ser eliminado por su burst de melee.",
    "Rebuttal es útil contra Yamato por su alto daño cuerpo a cuerpo. Si te ataca en melee, esta herramienta te permite reflejar parte del daño y controlar los intercambios de forma más segura.",
    "Monitorea su habilidad tres, que le otorga curación por golpe y porcentaje de vida máxima. Esta curación puede ser significativa, especialmente si invierte puntos temprano. En los intercambios, ten en cuenta los cooldowns de su uno y tres para maximizar tu efectividad y retroceder cuando sus habilidades estén disponibles nuevamente."
    ]
  }
  ]
}